Repository: aminjafari-dev/learning_english
Catalog: lib/l10n/app_*.arb
Languages: fa

source: Sign in with Google
fa: ورود با گوگل

# learnEnglishTitle
source: Learn English
fa: یادگیری زبان انگلیسی

source: Login with Google
fa: ورود با گوگل

# termsAndConditions
source: By logging in, you agree to our Terms & Conditions
fa: با ورود، شما با شرایط و ضوابط ما موافقت می‌کنید

# levelSelectionTitle
source: Select Your English Level
fa: سطح زبان انگلیسی خود را انتخاب کنید

# levelBeginner
source: Beginner
fa: مبتدی

# levelBeginnerDesc
source: For those with little to no English knowledge.
fa: برای افرادی با دانش کم یا بدون دانش زبان انگلیسی.

# levelElementary
source: Elementary
fa: ابتدایی

# levelElementaryDesc
source: Can understand basic phrases and simple sentences.
fa: قادر به درک عبارات ساده و جملات کوتاه.

# levelIntermediate
source: Intermediate
fa: متوسط

# levelIntermediateDesc
source: Can communicate in familiar situations and understand main ideas.
fa: قادر به برقراری ارتباط در موقعیت‌های آشنا و درک ایده‌های اصلی.

# levelAdvanced
source: Advanced
fa: پیشرفته

# levelAdvancedDesc
source: Can express ideas fluently and understand complex texts.
fa: قادر به بیان روان ایده‌ها و درک متون پیچیده.

source: Continue
fa: ادامه

# learningFocusTitle
source: Choose Your Learning Focus
fa: تمرکز یادگیری خود را انتخاب کنید

# learningFocusBack
source: Back
fa: برگشت

# learningFocusBusiness
source: Business English
fa: انگلیسی تجاری

# learningFocusTravel
source: Travel English
fa: انگلیسی سفر

# learningFocusSocial
source: Social English
fa: انگلیسی اجتماعی

# learningFocusHome
source: Home English
fa: انگلیسی خانگی

# learningFocusAcademic
source: Academic English
fa: انگلیسی آکادمیک

# learningFocusMovie
source: Movie English
fa: انگلیسی فیلم

# learningFocusMusic
source: Music English
fa: انگلیسی موسیقی

# learningFocusTV
source: TV English
fa: انگلیسی تلویزیون

# learningFocusShopping
source: Shopping English
fa: انگلیسی خرید

# learningFocusRestaurant
source: Restaurant English
fa: انگلیسی رستوران

# learningFocusHealth
source: Health English
fa: انگلیسی سلامت

# learningFocusEveryday
source: Everyday English
fa: انگلیسی روزمره

# learningFocusCustomHint
source: Or write your own learning focus...
fa: یا تمرکز یادگیری خود را بنویسید...

# learningFocusCustomLabel
source: Custom Learning Focus
fa: تمرکز یادگیری سفارشی

# learningFocusSavedSnack
source: Selection saved! Navigating...
fa: انتخاب ذخیره شد! در حال انتقال...

# focusAreasSelection
source: Focus Areas
fa: تمرکز های یادگیری

source: Vocabularies
fa: واژگان

source: Phrases
fa: عبارات

source: Next Lessons
fa: درس‌های بعدی

# errorAuth
source: Authentication failed. Please try again.
fa: احراز هویت ناموفق بود. لطفاً دوباره تلاش کنید.

# errorDatabase
source: Database operation failed. Please try again.
fa: عملیات پایگاه داده ناموفق بود. لطفاً دوباره تلاش کنید.

# errorNetwork
source: Network connection failed. Please check your internet connection and try again.
fa: اتصال شبکه ناموفق بود. لطفاً اتصال اینترنت خود را بررسی کرده و دوباره تلاش کنید.

# errorGeneric
source: An unexpected error occurred. Please try again.
fa: خطای غیرمنتظره‌ای رخ داد. لطفاً دوباره تلاش کنید.

# errorRetry
source: Retry
fa: تلاش مجدد

# errorClose
source: Close
fa: بستن

# errorContactSupport
source: Contact Support
fa: تماس با پشتیبانی

# levelSelection
source: Level
fa: سطح

# profileTitle
source: Profile
fa: پروفایل

source: Profile Image
fa: تصویر پروفایل

source: Change Photo
fa: تغییر عکس

source: Take Photo
fa: گرفتن عکس

source: Choose from Gallery
fa: انتخاب از گالری

source: Cancel
fa: لغو

source: Personal Information
fa: اطلاعات شخصی

source: Full Name
fa: نام کامل

source: Email
fa: ایمیل

source: Phone Number
fa: شماره تلفن

source: Date of Birth
fa: تاریخ تولد

source: App Settings
fa: تنظیمات برنامه

source: Language
fa: زبان

source: English
fa: انگلیسی

source: Persian
fa: فارسی

source: Save Changes
fa: ذخیره تغییرات

# changesSaved
source: Changes saved successfully!
fa: تغییرات با موفقیت ذخیره شد!

# errorSavingChanges
source: Error saving changes. Please try again.
fa: خطا در ذخیره تغییرات. لطفاً دوباره تلاش کنید.

source: Loading profile...
fa: در حال بارگذاری پروفایل...

source: History
fa: تاریخچه

source: Today
fa: امروز

source: Yesterday
fa: دیروز

# daysAgo
source: {count} days ago
fa: {count} روز پیش

source: at
fa: در

source: General Learning
fa: یادگیری عمومی

# levelBeginnerShort
source: Beginner
fa: مبتدی

# levelElementaryShort
source: Elementary
fa: ابتدایی

# levelIntermediateShort
source: Intermediate
fa: متوسط

# levelAdvancedShort
source: Advanced
fa: پیشرفته

source: Theme
fa: تم

source: Gold Theme
fa: تم طلایی

source: Blue Theme
fa: تم آبی

source: Yellow Light Theme
fa: تم زرد روشن

source: Light Blue Theme
fa: تم آبی روشن

source: Learning Paths
fa: مسیرهای یادگیری

source: Add Learning Path
fa: افزودن مسیر یادگیری

# addLearningPathDescription
source: Choose a focus area to begin your structured learning journey
fa: یک تمرکز یادگیری انتخاب کنید تا سفر یادگیری ساختاریافته خود را آغاز کنید

source: Start Learning
fa: شروع یادگیری

source: Select Sub-Category
fa: انتخاب زیردسته

# continueText
source: Continue
fa: ادامه

source: Course Progress
fa: پیشرفت دوره

source: Course Completed
fa: دوره تکمیل شد

# courseN
source: Course {number}
fa: دوره {number}

source: Progress
fa: پیشرفت

source: Delete Learning Path
fa: حذف مسیر یادگیری

# deleteLearningPathMessage
source: Are you sure you want to delete your current learning path? This action cannot be undone.
fa: آیا مطمئن هستید که می‌خواهید مسیر یادگیری فعلی خود را حذف کنید؟ این عمل قابل بازگشت نیست.

source: Delete
fa: حذف

source: Retry
fa: تلاش مجدد
